#include "Application.h"
#include "Player.h"
#include<iostream>

using namespace std;



Application::Application()
{
}


Application::~Application()
{
}


void Application::start_menu()
{
	cout << "==============================================================" << endl;
	cout << "**************************포켓몬스터**************************" << endl;
	cout << "--------------------------------------------------------------" << endl;
	cout << "                        1. 게임 시작" << endl;
	cout << "                        2. 종료" << endl;
	cout << "==============================================================" << endl;
	cout << "입력 :: ";
	cin >> input;

	if (input == 1)
	{

	}

	if (input == 2)
	{
		system("pause");
	}
}

void Application::run()
{
	cout << "==============================================================" << endl;
	cout << "*********************플레이어 이름 입력***********************"<< endl;
	cout << "--------------------------------------------------------------" << endl;
	cout << "입력 :: ";
	cin >> name;
	cout << "==============================================================" << endl;
	
	system("cls");

	cout << "==============================================================" << endl;
	cout << "************************포켓몬 선택***************************" << endl;
	cout << "--------------------------------------------------------------" << endl;
	cout << "                     1. 은서" << endl;
	cout << "                     2. 지수" << endl;
	cout << "                     3. 유현" << endl;
	cout << "==============================================================" << endl;
	cout << "입력 :: ";
	cin >> input;
	
	if (input == 1) //은서
	{
		system("cls");

		

		cout << "==============================================================" << endl;
		cout << "   플레이어 이름 :: " << name << "  내 포켓몬 :: 은서 " << endl;
		cout << "--------------------------------------------------------------" << endl;
		cout << "                     1. 야생으로 이동" << endl;
		cout << "                     2. 플레이어 정보 보기" << endl;
		cout << "                     3. 상점 가기" << endl;
		cout << "                     4. 병원 가기" << endl;
		cout << "                     5. 종료" << endl;
		cout << "==============================================================" << endl;
		cout << "입력 :: ";
		cin >> input;

		if (input == 1)
		{
			
		}

		if (input == 2)
		{

		}

		if (input == 3)
		{

		}

		if (input == 4)
		{

		}

		if (input == 5)
		{
			system("pause");
		}

	}

	else if (input == 2) //지수
	{
		system("cls");

		cout << "==============================================================" << endl;
		cout << "   플레이어 이름 :: " << name << "  내 포켓몬 :: 지수 " << endl;
		cout << "--------------------------------------------------------------" << endl;
		cout << "                     1. 야생으로 이동" << endl;
		cout << "                     2. 플레이어 정보 보기" << endl;
		cout << "                     3. 상점 가기" << endl;
		cout << "                     4. 병원 가기" << endl;
		cout << "                     5. 종료" << endl;
		cout << "==============================================================" << endl;
		cout << "입력 :: ";
		cin >> input;

	}

	else if (input == 3) //유현
	{
		system("cls");

		cout << "==============================================================" << endl;
		cout << "   플레이어 이름 :: " << name << "  내 포켓몬 :: 유현 " << endl;
		cout << "--------------------------------------------------------------" << endl;
		cout << "                     1. 야생으로 이동" << endl;
		cout << "                     2. 플레이어 정보 보기" << endl;
		cout << "                     3. 상점 가기" << endl;
		cout << "                     4. 병원 가기" << endl;
		cout << "                     5. 종료" << endl;
		cout << "==============================================================" << endl;
		cout << "입력 :: ";
		cin >> input;

	}


}

void Application::main_menu()
{
	char pokemon_name;

	cout << "==============================================================" << endl;
	cout << "플레이어 이름 :: " << name << "내 포켓몬 :: " << pokemon_name << endl;
	cout << "--------------------------------------------------------------" << endl;
	cout << "                     1. 야생으로 가기" << endl;
	cout << "                     2. 플레이어 정보 보기" << endl;
	cout << "                     3. 상점 가기" << endl;
	cout << "                     4. 병원 가기" << endl;
	cout << "                     5. 종료" << endl;
	cout << "==============================================================" << endl;
	cout << "입력 :: ";
}
